snlkuharlocal/src/Documents/СлужебнаяЗаписка/СлужебнаяЗаписка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СлужебнаяЗаписка</name>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияКоррекции</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработал</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДниПереработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентПереработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/СостоянияКоррекции/СостоянияКоррекции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияКоррекции</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
  </enumValues>
  <enumValues>
    <name>ПринятаЧастично</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Отработана</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипУзлаИБ/ТипУзлаИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУзлаИБ</name>
  <enumValues>
    <name>ИнтегральнаяИБ</name>
  </enumValues>
  <enumValues>
    <name>УправляющееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ТорговоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/СлужебнаяЗаписка/ObjectModule.bsl
Перем мСозданиеНевозможно Экспорт;
Перем НужноВыгружать;

Процедура ПриКопировании(ОбъектКопирования)
	
	Выгружено = ложь;
	согласована = ложь;
	состояние = перечисления.СостоянияКоррекции.ВРаботе;
	Утвердил = Справочники.ФизическиеЛица.ПустаяСсылка();
	Отработал = Утвердил;
	Сотрудники.очистить();
	//нечаева 05,12,17+++
	Период = НачалоМесяца(ТекущаяДата());
	Дата = ТекущаяДата();
	//нечаева 05,12,17---
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.	
	
	ЕстьИзменения		= Модифицированность();
	НужноВыгружать		= НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	//нечаева 04,10,17 ++++
	Если Выгружено = ложь Тогда
		  НужноВыгружать = ложь;
	КонецЕсли;
	//нечаева 04,10,17 ----
	
	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;
	
	
	// только для согласованных
	Если НужноВыгружать Тогда
		//                                                                            //нечаева 04,10,17 ++++
		Если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение и Выгружено = истина Тогда
			//из филиалов, если создали и провели первый раз.                         //нечаева 04,10,17 ----
			УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
		Иначе
			// Из Цо 
			Если Состояние= Перечисления.СостоянияКоррекции.Отклонена Или Состояние = Перечисления.СостоянияКоррекции.Утверждена Тогда
				УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
    	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) экспорт
	
	Если Отработал = справочники.ФизическиеЛица.ПустаяСсылка()  Тогда
		отработал = параметрысеанса.Пользователь.ФизЛицо;
	КонецЕсли;
	
КонецПроцедуры
